"""Входные данные
Даны два целых числа, каждое число записано в отдельной строке.

Выходные данные
Выведите наибольшее из данных чисел."""

firstNum = int(input())
secondNum = int(input())

if firstNum > secondNum: 
    print(firstNum)
else:
    print(secondNum)
